t1(no(10,no(8,no(4,f(2),f(5)),f(3)),no(6,f(1),f(9)))).
%no(10,no(8,no(4,f(2),f(5)),f(3)),no(6,f(1),f(9)))

/***********************************

Troca valor pela soma da subárvore

***********************************/

troca(no(Val, te, td), no(Soma, te2, td2)) :-
    soma_sub(no(Val, te, td), Soma),
    troca(te, te2),
    troca(td, td2).




/***********************************

      Soma valores da árvore

***********************************/
soma_sub(f(Val), Val).

soma_sub(no(Val, te, td), Soma) :-
    soma_sub(te, SomaTe),
    soma_sub(td, SomaTd),
    Soma is Val + SomaTe + SomaTd.


/***********************************

      Troca valor pela altura

***********************************/
troca_val(f(_), f(1)).

troca_val(no(_, te, td), no(H, te2, td2)) :-
    altura_no(no(_, te, td), H),
    troca_val(te, te2),
    troca_val(td, td2).


/***********************************

             altura 

***********************************/
altura_no(f(_), 1).
altura_no(no(_, te, td), H) :-
    altura_no(te, He),
    altura_no(td, Hd),
    maior(He, Hd, Hr),
    H is Hr + 1.

maior(He, Hd, He) :- He > Hd.
maior(He, Hd, Hd) :- He =< Hd.


/***********************************

             Soma No

***********************************/




/***********************************

             Soma Folha

***********************************/



/***********************************

              Pre Order               

***********************************/




/***********************************

              In Order  

***********************************/



/***********************************

             Pos Order   

***********************************/


/***********************************

         RLE - Codificacao

***********************************/



/***********************************

         RLE - Decodificacao

***********************************/


/********************************************
 
                    hanoi

********************************************/